### ERROR WHEN UPGRADE FROM <= 1.52.0 deployment to >= 1.53.0
Also, when upgrading from an existing deployment that was using provider version 1.52.0 or lower, an error occurs when upgrading to >= 1.53.0.

### Steps to Reproduce
1. `terraform apply` using provider <= 1.52.0
2. `terraform apply` on existing deployment, using provider >= 1.53.0

### Observed behavior after upgrade apply
```
Terraform will perform the following actions:

  # module.ocp_base.ibm_container_addons.addons will be updated in-place
  ~ resource "ibm_container_addons" "addons" {
        id                = "<redacted>"
      + manage_all_addons = true
      + managed_addons    = (known after apply)

        # (2 unchanged attributes hidden)

      + addons {
          + allowed_upgrade_versions = (known after apply)
          + deprecated               = (known after apply)
          + health_state             = (known after apply)
          + health_status            = (known after apply)
          + min_kube_version         = (known after apply)
          + min_ocp_version          = (known after apply)
          + name                     = "vpc-block-csi-driver"
          + options                  = (known after apply)
          + supported_kube_range     = (known after apply)
          + target_version           = (known after apply)
          + version                  = "5.0"
          + vlan_spanning_required   = (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

module.ocp_base.ibm_container_addons.addons: Modifying... [id=<redacted>]
│ Error: Request failed with status code: 409, ServerErrorResponse: {"incidentID":"028cd319-568e-4793-8197-c5aae64afa0e","code":"E4d8b","description":"An add-on with the same name already exists. To update your existing add-on to the latest version, see '[http://ibm.biz/addon-update'.","type":"Provisioning"}](http://ibm.biz/addon-update'.%22,%22type%22:%22Provisioning%22%7D)
│
│   with module.ocp_base.ibm_container_addons.addons,
│   on ../../main.tf line 360, in resource "ibm_container_addons" "addons":
│  360: resource "ibm_container_addons" "addons" {
│
```